{"format": "graph-model", "generatedBy": "2.2.0", "convertedBy": "TensorFlow.js Converter v2.6.0", "userDefinedMetadata": {"signature": {"inputs": {"input_1:0": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}, "input_2:0": {"name": "input_2:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "64"}]}}}}}, "modelTopology": {"node": [{"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_2", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT32"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, {"name": "Func/StatefulPartitionedCall/input_control_node/_0", "op": "NoOp", "input": ["^input_1", "^input_2"]}, {"name": "Func/StatefulPartitionedCall/input/_34", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_35", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_19", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "512"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_14", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_0/truediv_recip", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_9", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_3", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "64"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_4", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_5", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_6", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_7", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_8", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_10", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_11", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_12", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_13", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_15", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_16", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_17", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "512"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_18", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_20", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_21", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_22", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_23", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_24", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_25", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_26", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_27", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_28", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_29", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_5/conv_0/Pad/paddings", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_33", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/domain_0_style_fc/flatten/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_36", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_37", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_30", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/GatherV2/axis", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_31", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_32", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/init_conv/Pad", "op": "Pad", "input": ["input_1", "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_5/conv_0/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/init_conv/init_conv/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/init_conv/Pad", "Func/StatefulPartitionedCall/input/_3", "Func/StatefulPartitionedCall/input/_4"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_0/skip_conv/skip_conv/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/init_conv/init_conv/BiasAdd", "Func/StatefulPartitionedCall/input/_9"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_0/leaky_relu/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/init_conv/init_conv/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_0/avg_pool_1/AvgPool", "op": "AvgPool", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_0/skip_conv/skip_conv/Conv2D"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_0/conv_0/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_0/leaky_relu/LeakyRelu", "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_5/conv_0/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_0/conv_0/conv_0/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_0/conv_0/Pad", "Func/StatefulPartitionedCall/input/_5", "Func/StatefulPartitionedCall/input/_6"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_0/avg_pool/AvgPool", "op": "AvgPool", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_0/conv_0/conv_0/BiasAdd"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_0/leaky_relu_1/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_0/avg_pool/AvgPool"], "attr": {"alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_0/conv_1/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_0/leaky_relu_1/LeakyRelu", "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_5/conv_0/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_0/conv_1/conv_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_0/conv_1/Pad", "Func/StatefulPartitionedCall/input/_7", "Func/StatefulPartitionedCall/input/_8"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_0/add", "op": "AddV2", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_0/avg_pool_1/AvgPool", "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_0/conv_1/conv_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_0/truediv", "op": "Mul", "input": ["ConstantFolding/StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_0/truediv_recip", "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_0/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_1/skip_conv/skip_conv/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_0/truediv", "Func/StatefulPartitionedCall/input/_14"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_1/leaky_relu/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_0/truediv"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_1/avg_pool_1/AvgPool", "op": "AvgPool", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_1/skip_conv/skip_conv/Conv2D"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_1/conv_0/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_1/leaky_relu/LeakyRelu", "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_5/conv_0/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_1/conv_0/conv_0/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_1/conv_0/Pad", "Func/StatefulPartitionedCall/input/_10", "Func/StatefulPartitionedCall/input/_11"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_1/avg_pool/AvgPool", "op": "AvgPool", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_1/conv_0/conv_0/BiasAdd"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_1/leaky_relu_1/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_1/avg_pool/AvgPool"], "attr": {"alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_1/conv_1/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_1/leaky_relu_1/LeakyRelu", "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_5/conv_0/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_1/conv_1/conv_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_1/conv_1/Pad", "Func/StatefulPartitionedCall/input/_12", "Func/StatefulPartitionedCall/input/_13"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_1/avg_pool_1/AvgPool", "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_1/conv_1/conv_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_1/truediv", "op": "Mul", "input": ["ConstantFolding/StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_0/truediv_recip", "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_2/skip_conv/skip_conv/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_1/truediv", "Func/StatefulPartitionedCall/input/_19"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_2/leaky_relu/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_1/truediv"], "attr": {"alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_2/avg_pool_1/AvgPool", "op": "AvgPool", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_2/skip_conv/skip_conv/Conv2D"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_2/conv_0/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_2/leaky_relu/LeakyRelu", "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_5/conv_0/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_2/conv_0/conv_0/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_2/conv_0/Pad", "Func/StatefulPartitionedCall/input/_15", "Func/StatefulPartitionedCall/input/_16"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_2/avg_pool/AvgPool", "op": "AvgPool", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_2/conv_0/conv_0/BiasAdd"], "attr": {"padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_2/leaky_relu_1/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_2/avg_pool/AvgPool"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_2/conv_1/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_2/leaky_relu_1/LeakyRelu", "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_5/conv_0/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_2/conv_1/conv_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_2/conv_1/Pad", "Func/StatefulPartitionedCall/input/_17", "Func/StatefulPartitionedCall/input/_18"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_2/add", "op": "AddV2", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_2/avg_pool_1/AvgPool", "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_2/conv_1/conv_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_2/truediv", "op": "Mul", "input": ["ConstantFolding/StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_0/truediv_recip", "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_2/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_3/avg_pool_1/AvgPool", "op": "AvgPool", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_2/truediv"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_3/leaky_relu/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_2/truediv"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_3/conv_0/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_3/leaky_relu/LeakyRelu", "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_5/conv_0/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_3/conv_0/conv_0/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_3/conv_0/Pad", "Func/StatefulPartitionedCall/input/_20", "Func/StatefulPartitionedCall/input/_21"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_3/avg_pool/AvgPool", "op": "AvgPool", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_3/conv_0/conv_0/BiasAdd"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_3/leaky_relu_1/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_3/avg_pool/AvgPool"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_3/conv_1/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_3/leaky_relu_1/LeakyRelu", "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_5/conv_0/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_3/conv_1/conv_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_3/conv_1/Pad", "Func/StatefulPartitionedCall/input/_22", "Func/StatefulPartitionedCall/input/_23"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_3/add", "op": "AddV2", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_3/avg_pool_1/AvgPool", "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_3/conv_1/conv_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_3/truediv", "op": "Mul", "input": ["ConstantFolding/StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_0/truediv_recip", "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_3/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_4/avg_pool_1/AvgPool", "op": "AvgPool", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_3/truediv"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_4/leaky_relu/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_3/truediv"], "attr": {"alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_4/conv_0/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_4/leaky_relu/LeakyRelu", "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_5/conv_0/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_4/conv_0/conv_0/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_4/conv_0/Pad", "Func/StatefulPartitionedCall/input/_24", "Func/StatefulPartitionedCall/input/_25"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_4/avg_pool/AvgPool", "op": "AvgPool", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_4/conv_0/conv_0/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_4/leaky_relu_1/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_4/avg_pool/AvgPool"], "attr": {"alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_4/conv_1/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_4/leaky_relu_1/LeakyRelu", "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_5/conv_0/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_4/conv_1/conv_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_4/conv_1/Pad", "Func/StatefulPartitionedCall/input/_26", "Func/StatefulPartitionedCall/input/_27"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_4/add", "op": "AddV2", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_4/avg_pool_1/AvgPool", "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_4/conv_1/conv_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_4/truediv", "op": "Mul", "input": ["ConstantFolding/StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_0/truediv_recip", "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_4/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_5/avg_pool_1/AvgPool", "op": "AvgPool", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_4/truediv"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_5/leaky_relu/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_4/truediv"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_5/conv_0/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_5/leaky_relu/LeakyRelu", "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_5/conv_0/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_5/conv_0/conv_0/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_5/conv_0/Pad", "Func/StatefulPartitionedCall/input/_28", "Func/StatefulPartitionedCall/input/_29"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_5/avg_pool/AvgPool", "op": "AvgPool", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_5/conv_0/conv_0/BiasAdd"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_5/leaky_relu_1/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_5/avg_pool/AvgPool"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_5/conv_1/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_5/leaky_relu_1/LeakyRelu", "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_5/conv_0/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_5/conv_1/conv_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_5/conv_1/Pad", "Func/StatefulPartitionedCall/input/_30", "Func/StatefulPartitionedCall/input/_31"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_5/add", "op": "AddV2", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_5/avg_pool_1/AvgPool", "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_5/conv_1/conv_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_5/truediv", "op": "Mul", "input": ["ConstantFolding/StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_0/truediv_recip", "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_5/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/leaky_relu_0/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_5/truediv"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/conv/conv/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/leaky_relu_0/LeakyRelu", "Func/StatefulPartitionedCall/input/_32", "Func/StatefulPartitionedCall/input/_33"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/leaky_relu_1/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/conv/conv/BiasAdd"], "attr": {"alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/domain_0_style_fc/flatten/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/StyleEncoder/sequential_4/leaky_relu_1/LeakyRelu", "StatefulPartitionedCall/StyleEncoder/domain_0_style_fc/flatten/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/domain_0_style_fc/domain_0_style_fc/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/StyleEncoder/domain_0_style_fc/flatten/Reshape", "Func/StatefulPartitionedCall/input/_34", "Func/StatefulPartitionedCall/input/_35"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/domain_1_style_fc/domain_1_style_fc/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/StyleEncoder/domain_0_style_fc/flatten/Reshape", "Func/StatefulPartitionedCall/input/_36", "Func/StatefulPartitionedCall/input/_37"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/StyleEncoder/stack", "op": "Pack", "input": ["StatefulPartitionedCall/StyleEncoder/domain_0_style_fc/domain_0_style_fc/BiasAdd", "StatefulPartitionedCall/StyleEncoder/domain_1_style_fc/domain_1_style_fc/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "axis": {"i": "1"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/StyleEncoder/stack", "input_2", "StatefulPartitionedCall/StyleEncoder/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "-1"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StyleEncoder/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/StyleEncoder/GatherV2"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/StyleEncoder/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 175}}, "weightsManifest": [{"paths": ["group1-shard1of5.bin", "group1-shard2of5.bin", "group1-shard3of5.bin", "group1-shard4of5.bin", "group1-shard5of5.bin"], "weights": [{"name": "Func/StatefulPartitionedCall/input/_34", "shape": [512, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.27082370589761173, "scale": 0.0021840621443355783, "original_dtype": "float32"}}, {"name": "Func/StatefulPartitionedCall/input/_35", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.15601293047269185, "scale": 0.0013110330291822845, "original_dtype": "float32"}}, {"name": "Func/StatefulPartitionedCall/input/_19", "shape": [1, 1, 256, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.4091114836580613, "scale": 0.0029645759685366763, "original_dtype": "float32"}}, {"name": "Func/StatefulPartitionedCall/input/_14", "shape": [1, 1, 128, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5106021084037482, "scale": 0.0040848168672299855, "original_dtype": "float32"}}, {"name": "ConstantFolding/StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_0/truediv_recip", "shape": [], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.7071067690849304, "scale": 1.0, "original_dtype": "float32"}}, {"name": "Func/StatefulPartitionedCall/input/_9", "shape": [1, 1, 64, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.587368220908969, "scale": 0.004736840491201363, "original_dtype": "float32"}}, {"name": "Func/StatefulPartitionedCall/input/_3", "shape": [3, 3, 3, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.7634338645374074, "scale": 0.006206779386482987, "original_dtype": "float32"}}, {"name": "Func/StatefulPartitionedCall/input/_4", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.08072896582238814, "scale": 0.00062580593660766, "original_dtype": "float32"}}, {"name": "Func/StatefulPartitionedCall/input/_5", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2994253538402857, "scale": 0.002108629252396378, "original_dtype": "float32"}}, {"name": "Func/StatefulPartitionedCall/input/_6", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.08276288903811399, "scale": 0.0005205213147051194, "original_dtype": "float32"}}, {"name": "Func/StatefulPartitionedCall/input/_7", "shape": [3, 3, 64, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.26513683328441545, "scale": 0.0020395141021878112, "original_dtype": "float32"}}, {"name": "Func/StatefulPartitionedCall/input/_8", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.09003361130461973, "scale": 0.0006124735462899302, "original_dtype": "float32"}}, {"name": "Func/StatefulPartitionedCall/input/_10", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2077556819308038, "scale": 0.001585921236113006, "original_dtype": "float32"}}, {"name": "Func/StatefulPartitionedCall/input/_11", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.071209918050205, "scale": 0.0005394690761379167, "original_dtype": "float32"}}, {"name": "Func/StatefulPartitionedCall/input/_12", "shape": [3, 3, 128, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.23909837428261252, "scale": 0.0018113513203228222, "original_dtype": "float32"}}, {"name": "Func/StatefulPartitionedCall/input/_13", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.07939769707474054, "scale": 0.0004962356067171284, "original_dtype": "float32"}}, {"name": "Func/StatefulPartitionedCall/input/_15", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.15420105089159572, "scale": 0.0012336084071327658, "original_dtype": "float32"}}, {"name": "Func/StatefulPartitionedCall/input/_16", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.06668121398371808, "scale": 0.00041937870430011376, "original_dtype": "float32"}}, {"name": "Func/StatefulPartitionedCall/input/_17", "shape": [3, 3, 256, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.17935601122239056, "scale": 0.0013384776956894817, "original_dtype": "float32"}}, {"name": "Func/StatefulPartitionedCall/input/_18", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.07998312403466187, "scale": 0.0005516077519631854, "original_dtype": "float32"}}, {"name": "Func/StatefulPartitionedCall/input/_20", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1752111409224716, "scale": 0.0012515081494462257, "original_dtype": "float32"}}, {"name": "Func/StatefulPartitionedCall/input/_21", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0413320604711771, "scale": 0.00025049733618895214, "original_dtype": "float32"}}, {"name": "Func/StatefulPartitionedCall/input/_22", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1664010800567328, "scale": 0.0011971300723505956, "original_dtype": "float32"}}, {"name": "Func/StatefulPartitionedCall/input/_23", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.07356185363788231, "scale": 0.00044854788803586776, "original_dtype": "float32"}}, {"name": "Func/StatefulPartitionedCall/input/_24", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.17557857036590577, "scale": 0.001291018899749307, "original_dtype": "float32"}}, {"name": "Func/StatefulPartitionedCall/input/_25", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.06451789435802721, "scale": 0.00031472143589281567, "original_dtype": "float32"}}, {"name": "Func/StatefulPartitionedCall/input/_26", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.16563375019559673, "scale": 0.0012643797724854711, "original_dtype": "float32"}}, {"name": "Func/StatefulPartitionedCall/input/_27", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1036739522335576, "scale": 0.0006820654752207737, "original_dtype": "float32"}}, {"name": "Func/StatefulPartitionedCall/input/_28", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.22752214880550609, "scale": 0.0015168143253700406, "original_dtype": "float32"}}, {"name": "Func/StatefulPartitionedCall/input/_29", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.06439998965052997, "scale": 0.0004293332643368665, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/StyleEncoder/sequential_4/resblock_5/conv_0/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/input/_33", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.18263927978627822, "scale": 0.0013528835539724313, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/StyleEncoder/domain_0_style_fc/flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/input/_36", "shape": [512, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2532200778231901, "scale": 0.002025760622585521, "original_dtype": "float32"}}, {"name": "Func/StatefulPartitionedCall/input/_37", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.12844780905573977, "scale": 0.0010528508938995062, "original_dtype": "float32"}}, {"name": "Func/StatefulPartitionedCall/input/_30", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": 